app/controllers/api/v1/authentication_controller.rb

    def login
        user = User.find_by(username: params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "chautran"], ["LIMIT", 1]]

    def user
        user = User.find(decoded_token["user_id"])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]