app/controllers/api/v1/users_controller.rb

    def create
        user = User.new(user_params)
        if user.save
---
INSERT INTO "users" ("username", "password_digest", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

    def usernames
        render json: {usernames: User.all.map{|u| u.username}}
---
SELECT "users".* FROM "users"