app/controllers/application_controller.rb

    def authorized
        current_user = User.find(decoded_token["user_id"]) if decoded_token
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]